# Formulae (Required)
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "node"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tree-sitter"
brew "yazi"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks (Required)
cask "kitty"
cask "docker"
cask "obsidian"
cask "vivaldi"
cask "visual-studio-code"
cask "warp"
cask "bitwarden"
cask "figma"
cask "raycast"

# Optional Formulae
tap "felixkratz/formulae"
brew "sketchybar"
tap "nikitabobko/tap"
cask "aerospace"
cask "ghostty"
brew "tmux"
tap "oven-sh/bun"
brew "bun"
brew "github-copilot-cli"
